backend/app/controllers/opps_controller.rb

    def index
        @opps = Opp.all
---
SELECT "opps".* FROM "opps"

    def find_opp
        @opp = Opp.find(params[:id])
---
SELECT "opps".* FROM "opps" WHERE "opps"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]