backend/app/controllers/shelters_controller.rb

SELECT "shelters".* FROM "shelters"
---
    def index
        shelter = Shelter.all

SELECT "shelters".* FROM "shelters" WHERE "shelters"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def find_shelter
        @shelter = Shelter.find(params[:id])