backend/app/controllers/user_opps_controller.rb

SELECT "user_opps".* FROM "user_opps"
---
   def index
      user_opp = UserOpp.all

INSERT INTO "user_opps" ("user_id", "opp_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["opp_id", 1], ["created_at", "2020-10-20 15:25:57.161194"], ["updated_at", "2020-10-20 15:25:57.161194"]]
---
   def create
      user_opp = UserOpp.create(user_id:params[:user_id], opp_id:params[:opp_id])