backend/app/controllers/users_controller.rb

    def create
        @user = User.create(users_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "username", "password_digest", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)